//Напишите программу, выводящую на экран все элементы массива, которые меньше последнего.
// arr[5] = 10, 93, 22, 75, 12
// Вывод: 10

/*Элементы массива, которые меньше его последнего элемента в том порядке, 
как они встречаются в массиве, через пробел, или же число 0, 
если таких элементов не существует. */

#include <stdio.h>

int main() {
	int arr[100];
	int n;
	scanf("%d", &n);
	for(int i = 0; i < n; i = i + 1) {
		scanf("%d", &arr[i]);
	}
	int count = 0;
	for(int i = 0; i < n; i = i + 1) {
		if(arr[i] < arr[n - 1]) {
			count = count + 1;
			printf("%d ", arr[i]);
		}
		
	}
	if(count == 0) {
		printf("0");
		
	}
	return 0;
}
